[
{"title": "Trains Stopped As Farmers Squat On Tracks In Parts Of Haryana, UP", "text": "Trains stopped as farmers squat on tracks in parts of Haryana, UP as part of nationwide protest against farm laws", "link": "https://www.ndtv.com/india-news/trains-stopped-as-farmers-squat-on-tracks-in-parts-of-haryana-up-as-part-of-nationwide-protest-against-farm-laws-2373178"},
{"title": "Bhim Army Chief, 5 Indian-Origin Persons On TIME's Emerging Leaders List", "text": "Five Indian-origin personalities, including Twitter's top lawyer Vijaya Gadde and UK's finance minister Rishi Sunak, and an Indian activist feature in TIME magazine's annual list of 100 \"emerging leaders who are shaping the future\".", "link": "https://www.ndtv.com/india-news/bhim-army-chief-chandrashekhar-aazad-5-indian-origin-persons-on-times-emerging-leaders-list-2373165"},
{"title": "'Metro Man' E Sreedharan To Join BJP, Says Open To Fighting Kerala Polls", "text": "E Sreedharan, the engineering legend behind the Delhi Metro and many similar projects across the country, is set to join the BJP months ahead of polls in Kerala.", "link": "https://www.ndtv.com/india-news/metro-man-e-sreedharan-to-join-bjp-will-likely-contest-in-kerala-election-2373136"},
{"title": "'Was Being Pressured To Join...': Mamata Banerjee On Attack On Minister", "text": "The bomb attack on West Bengal Labour Minister Jakir Hossain was part of a conspiracy because \"some people were pressuring\" him to join their party, Chief Minister Mamata Banerjee said today, comparing it to the assassination of Punjab Chief Minister Beant Singh in the 1990s. She also held Indian Railways responsible for the incident since it took place on the transporters' premises.", "link": "https://www.ndtv.com/india-news/bomb-attack-on-bengal-minister-jakir-hossain-at-railway-station-part-of-conspiracy-says-mamata-banerjee-2373114"},
{"title": "Pariksha Pe Charcha 2021: PM Modi Invites Students For 'Fun Filled' Chat", "text": "Pariksha Pe Charcha 2021: Prime Minister Narendra Modi's 'Pariksha Pe Charcha' for students appearing for Class 10 and 12 board examinations will be back soon. Taking to Twitter, PM Modi on Thursday wrote: \"As our brave 'Exam Warriors' start padding up for their exams, 'Pariksha Pe Charcha 2021' returns, this time fully online and open to students all over the world.", "link": "https://www.ndtv.com/india-news/pariksha-pe-charcha-2021-pm-modi-invites-exam-warriors-for-fun-filled-discussion-2373095"},
{"title": "Exclusive: Government Develops Its Own WhatsApp, It's Being Tested Now", "text": "Amid the raging controversy over privacy on WhatsApp, the government is planning a whole new approach - its own version of the messaging app. Sources in the Ministry of Electronics and Information and Technology (MeITY) have confirmed to NDTV that two apps are presently being developed and tested and are in beta stage. They have been codenamed Samvad and Sandes, literally \"conversation\" and \"message\", respectively.", "link": "https://www.ndtv.com/india-news/exclusive-sandes-and-samvad-are-sarkari-answer-to-whatsapp-2373082"},
{"title": "Rail Roko Will Be Peaceful, Will Not Join Politics: Rakesh Tikait", "text": "Bharatiya Kisan Union leader Rakesh Tikait on Thursday said that 'rail roko', the blockade of trains as part of protests against farm laws, will be done in a peaceful manner and food and refreshments provided to people stranded due to the protest. He also stated that he will not join politics as he considers it \"a big disease\".", "link": "https://www.ndtv.com/india-news/rail-roko-will-be-peaceful-will-not-join-politics-rakesh-tikait-2373061"},
{"title": "Bengal Minister Jakir Hossain Injured In Bomb Attack, CID Takes Over Probe", "text": "West Bengal CID takes over the case, in which state Labour Minister Jakir Hossain suffered injuries, after unidentified people hurled a bomb at him in Murshidabad on Wednesday, sources said on Thursday.", "link": "https://www.ndtv.com/india-news/west-bengal-cid-to-probe-bomb-attack-on-minister-jakir-hossain-2373041"},
{"title": "Can't Rule Out Conspiracy Against Ex Chief Justice Gogoi: Supreme Court", "text": "The possibility of a conspiracy against former Chief Justice Ranjan Gogoi cannot be ruled out, the Supreme Court said today, closing an inquiry set up after he was accused of sex harassment.", "link": "https://www.ndtv.com/india-news/supreme-court-says-conspiracy-cant-be-ruled-out-against-former-chief-justice-of-india-ranjan-gogoi-closes-case-2373063"},
{"title": "India Reports 12,881 New COVID-19 Cases", "text": "As many as 12,881 new COVID-19 cases and 101 deaths were reported in the country in the last 24 hours, the Union Ministry of Health and Family Welfare (MoHFW) said on Thursday.", "link": "https://www.ndtv.com/india-news/india-reports-12-881-new-covid-19-cases-2373020"},
{"title": "VK Sasikala's Court Move To Reclaim AIADMK Top Post Ahead Of State Polls", "text": "VK Sasikala, the sacked AIADMK chief released from jail last month, has taken a legal step towards reclaiming her position in Tamil Nadu's ruling party months ahead of polls.", "link": "https://www.ndtv.com/india-news/tamil-nadu-election-2021-vk-sasikalas-court-move-to-reclaim-aiadmk-top-post-ahead-of-state-polls-2373046"},
{"title": "Third Quad Ministerial Meeting To Discuss Regional, Global Issues", "text": "External Affairs Minister S Jaishankar will join his counterparts from the US, Japan and Australia on Thursday under the framework of Quad coalition to deliberate on ways to enhance cooperation in the Indo-Pacific in the backdrop of growing Chinese assertiveness in the region.", "link": "https://www.ndtv.com/india-news/third-quad-ministerial-meeting-to-discuss-regional-global-issues-2373043"},
{"title": "Kavin Bharti Mittal's Startup, Crushed By WhatsApp, Plans To Rival Facebook", "text": "Kavin Bharti Mittal, a scion of the family behind India's second-biggest wireless operator, is planning to revive his struggling technology startup more than four years after it was valued at $1.4 billion by backers including Softbank Group Corp.", "link": "https://www.ndtv.com/india-news/kavin-bharti-mittals-vibe-app-to-take-on-facebook-2373009"},
{"title": "Watch: How Woman Escaped Being Crushed Under Moving Train In Haryana", "text": "A woman escaped being run over by a train yesterday simply by lying low on the track as the carriages passed above her. The incident took place in Rohtak district of Haryana and was witnessed by scores and captured on camera.", "link": "https://www.ndtv.com/india-news/watch-rohtak-woman-escapes-being-run-over-by-lying-low-under-moving-train-2372998"},
{"title": "Kumbh Mela: Dates, Pass, COVID-19 Test Report And All You Need To Know", "text": "Kumbh Mela 2021: Due to the coronavirus pandemic, the Uttarakhand government has decided to limit the Kumbh this year to 30 days. The Kumbh administration has also put cameras at the Ganga Ghats to monitor the crowd.", "link": "https://www.ndtv.com/india-news/kumbh-2021-limited-to-30-days-to-begin-on-april-1-2372990"},
{"title": "Mamata Banerjee, Amit Shah's Rallies In Same Bengal District Today", "text": "A head-to-head political battle will play out on Thursday in Kolkata neighbouring South 24 Parganas district where Home Minister Amit Shah and West Bengal Chief Minister Mamata Banerjee are scheduled to address independent rallies separated by some distance.", "link": "https://www.ndtv.com/india-news/west-bengal-election-2021-mamata-banerjee-amit-shahs-rallies-in-same-bengal-district-today-2372988"},
{"title": "'India A Critical Partner': Pentagon Ahead Of Quad Ministers' Meet Today", "text": "India is a critical partner, especially when one considers all the challenges in the Indo-Pacific region, the Pentagon said on the eve of the first Quad ministerial meeting under the Biden administration.", "link": "https://www.ndtv.com/india-news/india-a-critical-partner-pentagon-ahead-of-quad-ministers-meet-today-2372987"},
{"title": "2 Girls, Cousins, Found Dead In UP Field, Third Critical", "text": "Two girls were found dead in a field in Uttar Pradesh's Unnao last evening, the police said today, adding that a third girl found with them is critical in hospital.", "link": "https://www.ndtv.com/india-news/unnao-uttar-pradesh-2-girls-cousins-found-dead-in-up-field-bodies-tied-up-third-critical-2372981"},
{"title": "Not Willing To Contest Assembly Poll, Informed Party A Year Ago: Himanta Sarma", "text": "Senior Assam minister Himanta Biswa Sarma on Wednesday said that he communicated to state BJP chief Ranjeet Kumar Dass a year ago that he did not wish to contest the 2021 assembly election.", "link": "https://www.ndtv.com/india-news/not-willing-to-contest-assembly-poll-informed-party-a-year-ago-himanta-biswa-sarma-2372977"},
{"title": "'Stop Vaccine Nationalism, Encourage Internationalism': India At UN Meet On Covid", "text": "India, which has shipped 'Made In India'' COVID-19 vaccines to 25 countries, on Wednesday appealed the international community to stop \"vaccine nationalism\" and actively encourage \"internationalism\", underlining that hoarding superfluous doses will defeat global efforts to attain collective health security and combat the deadly pandemic.", "link": "https://www.ndtv.com/india-news/india-at-un-meet-on-covid-stop-vaccine-nationalism-encourage-internationalism-2372957"},
{"title": "Encourage Students To Take Online Exam On 'Cow Science': UGC To Universities", "text": "The University Grants Commission has asked vice chancellors of varsities across the country to \"encourage\" students to take an online voluntary national-level exam to test their knowledge on ''gau vigyan'' (cow science).", "link": "https://www.ndtv.com/india-news/university-grants-commission-asks-universities-to-encourage-students-to-take-voluntary-online-exam-on-cow-science-2372949"},
{"title": "4.7 Magnitude Earthquake Strikes Assam", "text": "An earthquake measuring 4.7 shook Sonitpur district of Assam and Guwahati at 5.54 pm on Wednesday, the National Centre for Seismology (NCS) said.", "link": "https://www.ndtv.com/india-news/4-7-magnitude-earthquake-strikes-assam-2372936"},
{"title": "West Bengal Assembly Elections: Prosenjit Chatterjee Denies Rumours Of Joining BJP", "text": "Bengali film icon Prosenjit Chatterjee on Wednesday scorched rumours of his joining BJP, while his colleague in the industry Yash Dasgupta and several other actors joined the saffron camp before the West Bengal assembly poll.", "link": "https://www.ndtv.com/india-news/west-bengal-assembly-elections-prosenjit-chatterjee-denies-rumours-of-joining-bjp-2372935"},
{"title": "Rupees 5 Lakh Reward For 3 People Who Saved Lives In Madhya Pradesh Bus Tragedy", "text": "Madhya Pradesh Chief Minister Shivraj Singh Chouhan on Wednesday announced rewards of Rs 5 lakh each for three persons including a young woman who saved lives after a bus fell into a canal in Sidhi district.", "link": "https://www.ndtv.com/india-news/madhya-pradesh-chief-minister-shivraj-singh-chouhan-announces-reward-of-rupees-5-lakh-each-for-three-people-who-saved-lives-in-bus-tragedy-2372925"},
{"title": "Shivraj Singh Chouhan Suspends Four Officials After Bus Tragedy In Madhya Pradesh", "text": "Madhya Pradesh Chief Minister Shivraj Singh Chouhan on Wednesday night suspended the Regional Transport Officer (RTO) of Sidhi district and three officials of the MP Road Development Corporation (MPRDC) after", "link": "https://www.ndtv.com/india-news/madhya-pradesh-chief-minister-shivraj-singh-chouhan-suspends-four-officials-after-bus-tragedy-in-state-2372920"},
{"title": "Does Modi Government Still Believe Farm Laws Are Popular: P Chidambaram After Punjab Win", "text": "After the Congress's victory in Punjab municipal elections, senior party leader P Chidambaram on Wednesday asked whether the Modi government still believed that farm laws are popular and only a small section of farmers of Punjab are protesting against them.", "link": "https://www.ndtv.com/india-news/does-modi-government-still-believe-farm-laws-are-popular-p-chidambaram-after-congress-win-in-punjab-2372917"},
{"title": "Latest News Live Updates:12,881 New Coronavirus Cases In India", "text": "India's COVID-19 infection tally climbed to 1,09,50,201 with 12,881 new cases in a day, while 1,06,56,845 people have recuperated so far pushing the national recovery rate to 97.32 per cent on Thursday, according to Union Health Ministry data.", "link": "https://www.ndtv.com/india-news/latest-news-live-updates-india-to-gift-2-00-000-doses-of-coronavirus-vaccine-to-un-peacekeepers-2372916"},
{"title": "2 Assam Journalists Arrested For Alleged Attempt To 'Malign' Himanta Sarma: Police", "text": "Two journalists were arrested and three others detained on Wednesday for their alleged attempt to malign Assam minister Himanta Biswa Sarma after they shared a photo of him along with his daughter with a \"salacious intent\", the police said.", "link": "https://www.ndtv.com/india-news/two-assam-journalists-arrested-3-others-detained-for-alleged-attempt-to-malign-himanta-sarma-police-2372913"},
{"title": "Indian Appointed As Under-Secretary-General, Associate Administrator Of UN Development Programme", "text": "Leading investment professional Usha Rao-Monari of India has been appointed by UN Secretary General Antonio Guterres as Under-Secretary-General and Associate Administrator of the United Nations Development Programme (UNDP).", "link": "https://www.ndtv.com/indians-abroad/un-chief-appoints-indian-investment-professional-usha-rao-monari-as-under-secretary-general-and-associate-administrator-of-undp-2372899"},
{"title": "India Would Like To Work More Closely With Russia On Taking Forward Co-Op In Indo-Pacific: Foreign Secretary", "text": "India would like to work more closely with Russia on taking forward the cooperation in the Indo-Pacific region, Foreign Secretary Harsh Vardhan Shringla said on Wednesday.", "link": "https://www.ndtv.com/india-news/foreign-secretary-harsh-vardhan-shringla-india-would-like-to-work-more-closely-with-russia-on-taking-forward-cooperation-in-indo-pacific-2372892"},
{"title": "Asaram Hospitalised In Rajasthan After Complaining Of Chest Pain", "text": "Self-styled ''godman'' Asaram, who is serving a life sentence in a rape case, was hospitalised on Tuesday night after he complained of chest pain and breathing difficulty, officials said.", "link": "https://www.ndtv.com/india-news/asaram-hospitalised-in-rajasthan-after-complaining-of-chest-pain-2372891"},
{"title": "'Powerful Action From India Will Be A Catalyst For Change': Top UN Climate Official", "text": "Alok Sharma, President-designate of 26th United Nations Climate Change Conference (COP26), witnessed India's ambitious work on renewable energy, and held vital discussions with government leaders, including Prime Minister Modi, businesses and civil society during his two-day visit to New Delhi.", "link": "https://www.ndtv.com/india-news/uk-witnesses-indias-ambitious-work-on-renewable-energy-ahead-of-cop26-summit-2372886"},
{"title": "India, China Can't Have 'Normal' Relationship If There Is 'Transgression' At Border: Foreign Secretary", "text": "India's relationship with China is \"complex\" and the two neighbours cannot have a \"normal\" bilateral relationship if there is \"transgression\" in the border areas, Foreign Secretary Harsh Vardhan Shringla said on Wednesday.", "link": "https://www.ndtv.com/india-news/foreign-secretary-harsh-vardhan-shringla-says-india-china-cannot-have-normal-relationship-if-there-is-transgression-in-border-areas-2372885"},
{"title": "Over 90-Lakh Coronavirus Vaccine Doses Administered Till Now: Government", "text": "Over 90 lakh COVID-19 vaccine doses have been administered till now and no case of serious or severe adverse event following immunisation or death attributable to vaccination has been reported, the Union Health Ministry said on Wednesday.", "link": "https://www.ndtv.com/india-news/over-90-lakh-coronavirus-vaccine-doses-administered-government-2372881"},
{"title": "Piyush Goyal Invites US Firms To Manufacture In India", "text": "Asserting the need to further the bilateral trade and economic engagement with a greater degree of flexibility, Union Minister of Commerce and Industry Piyush Goyal on Wednesday invited the United States to look at India as a manufacturing base.", "link": "https://www.ndtv.com/india-news/piyush-goyal-invites-us-firms-to-manufacture-in-india-2372878"},
{"title": "Watch: Lost In Translation, Puducherry Woman's Complaint To Rahul Gandhi", "text": "A fisherwoman's complaint to Rahul Gandhi went astray on Wednesday as Puducherry Chief Minister V Narayansamy translated for her. The Chief Minister - struggling with a potential crisis in his government - had accompanied Mr Gandhi during his visit to the fishermen, a key community in the seaside town.", "link": "https://www.ndtv.com/india-news/watch-lost-in-translation-puducherry-womans-complaint-to-rahul-gandhi-2372877"},
{"title": "Amit Shah To Flag Off 5th Phase Of BJP's ", "text": "Union Home Minister Amit Shah arrived in Kolkata for a visit to the state where Assembly polls are scheduled to be held later this year.", "link": "https://www.ndtv.com/india-news/amit-shah-arrives-in-kolkata-to-flag-off-5th-phase-of-bjps-poriborton-yatra-today-2372876"},
{"title": "BJP Leader Injured In Attack In Kolkata, Hospitalised", "text": "BJP District President North Kolkata Shibaji Singha Roy sustained injuries after he along with party leaders including Suvendu Adhikari and Shankudeb Panda was attacked allegedly by some personsat Phoolbagan.", "link": "https://www.ndtv.com/india-news/bjps-shibaji-singha-roy-injured-in-attack-in-kolkata-hospitalised-2372874"},
{"title": "Congress To Collect 50 Lakh '", "text": "Following Rahul Gandhi's emphatic assertion that the Congress will not implement the Citizenship (Amendment) Act if voted to power in Assam, the state unit of the party Wednesday urged cadres to collect \"Gamochas\" (Assamese scarf) with messages against the law.", "link": "https://www.ndtv.com/india-news/congress-to-collect-50-lakh-gamochas-with-anti-caa-messages-2372870"},
{"title": "PM Modi To Address Convocation Of Visva-Bharati University On Friday", "text": "Prime Minister Narendra Modi will address the convocation of Visva-Bharati University on February 19 at 11 am via video conferencing.", "link": "https://www.ndtv.com/india-news/pm-modi-to-address-convocation-of-visva-bharati-university-on-friday-2372865"},
{"title": "Following Mamata Banerjee's Script, BJP Casts Bengal Actors Before Polls", "text": "The BJP vs Trinamool battle for Bengal is promising to turn into a starry one. About a dozen actors and actresses from Tollywood - Kolkata's version of Bollywood - joined the BJP on Wednesday with just days to go for dates to be declared for the assembly polls.", "link": "https://www.ndtv.com/india-news/following-mamata-banerjees-script-bjp-casts-bengal-actors-before-polls-2372863"},
{"title": "India Surpasses China In Fintech Deals: Report", "text": "India has emerged as Asia's biggest destination for financial technology (fintech) deals, leaving behind China in the quarter ended June 2020, a research report said on Wednesday.", "link": "https://www.ndtv.com/india-news/india-surpasses-china-in-fintech-deals-2372862"},
{"title": "Devotee Donates Ornaments Worth Rs 2.3 Crore To Puri Jagannath Temple", "text": "On the occasion of Shree Panchami, a devotee of Lord Jagannath has donated specially designed gold and silver ornaments, worth over Rs 2.33 crore, for the trinity of the 12th century shrine, Shree Jagannath Temple Administration (SJTA) in Puri said.", "link": "https://www.ndtv.com/india-news/devotee-donates-ornaments-worth-rs-2-3-crore-to-puri-jagannath-temple-2372859"},
{"title": "Actor-Turned-Trinamool MLA Chiranjeet Chakraborty Wishes To Quit Politics", "text": "Amid an ongoing exodus of TMC leaders from the ruling party in West Bengal ahead of the assembly elections, actor-turned-MLA Chiranjeet Chakraborty on Wednesday expressed his desire to quit politics and focus more on acting.", "link": "https://www.ndtv.com/assembly-west-bengal/actor-turned-trinamool-mla-chiranjeet-chakraborty-wishes-to-quit-politics-2372853"},
{"title": "Amarinder Singh Visits Farmers' Protest Site In Chandigarh, Warns Centre", "text": "The Centre should not take the farmers' agitation against the three agriculture laws lightly, Punjab Chief Minister Amarinder Singh tweeted on Wednesday, after visiting a protest site in the state capital Chandigarh.", "link": "https://www.ndtv.com/india-news/amarinder-singh-visits-farmers-protest-site-in-chandigarh-warns-centre-2372845"},
{"title": "Delhi Police To Probe Role Of UK-Based Woman In 'Toolkit' Case", "text": "Delhi Police Wednesday said a UK-based woman based allegedly drafted the content of a \"Twitter storm\" campaign in February in support of the ongoing farmer agitation along with lawyer Nikita Jacob and engineer Shantanu Muluk and her role will be investigated.", "link": "https://www.ndtv.com/india-news/delhi-police-to-probe-role-of-uk-based-woman-in-toolkit-case-2372843"},
{"title": "On Camera, Dancing Bride's Narrow Escape As Car Hits Wedding Party In UP", "text": "Tragedy struck a wedding procession in Uttar Pradesh's Muzaffarnagar on Tuesday, after a speeding vehicle hit members of the bride's party", "link": "https://www.ndtv.com/india-news/on-camera-speeding-car-hits-brides-wedding-party-in-ups-muzaffarnagar-2372840"},
{"title": "Financial Powers Delegated Below Vice-Chief Level For Capital Procurement In Armed Forces", "text": "The Union Cabinet on Wednesday approved enhanced delegation of financial powers to the tune of up to Rs 200 crore under capital procurement to levels below vice-chief of Armed Forces.", "link": "https://www.ndtv.com/india-news/cabinet-approves-enhanced-delegation-of-financial-power-to-levels-below-vice-chief-of-armed-forces-2372836"},
{"title": "Congress Leader, Gandhi Loyalist Captain Satish Sharma Dies In Goa Aged 73", "text": "Congress leader and former Union Minister Captain Satish Sharma died in Goa on Wednesday after a brief illness. He was 73.", "link": "https://www.ndtv.com/india-news/congress-leader-gandhi-loyalist-captain-satish-sharma-dies-in-goa-aged-73-2372833"},
{"title": "600 Sikh Pilgrims Not Allowed To Visit Pak Over Threat To Life: Centre", "text": "The Union Home Ministry Thursday denied permission to 600 Sikh pilgrims intending to visit gurdwaras in Pakistan citing the security and COVID-19 situation in that country, officials said.", "link": "https://www.ndtv.com/india-news/600-sikh-pilgrims-not-allowed-to-visit-pakistan-over-threat-to-life-centre-2372825"},
{"title": "Do's And Don'ts For International Fliers Amid New Covid Worry", "text": "India today announced a fresh set of guidelines for international travellers after two new strains of coronavirus - the UK and the South African strains - were detected in the country. These new guidelines will be implemented from the midnight of February 23 until further orders, the health ministry said in a statement.", "link": "https://www.ndtv.com/india-news/dos-and-donts-for-international-fliers-amid-new-covid-worry-2372819"},
{"title": "India Announces Gift Of 2,00,000 COVID-19 Doses For UN Peacekeepers", "text": "India, hailed as the pharmacy of the world, on Wednesday announced a gift of 200,000 COVID-19 doses for UN peacekeepers.", "link": "https://www.ndtv.com/india-news/india-announces-gift-of-2-00-000-covid-19-doses-for-un-peacekeepers-2372818"},
{"title": "Rigidity Okay With Compassionate Motive: Dalai Lama To Indian Police", "text": "The Dalai Lama today said it is okay for police to be rigid on their job as long as the motivation of their action is larger good.", "link": "https://www.ndtv.com/india-news/rigidity-okay-with-compassionate-motive-dalai-lama-to-indian-police-2372809"},
{"title": "Unclaimed Bag With Rs 1.4 Crore Cash Found In Train, Cops Investigate", "text": "An unclaimed bag containing cash worth around Rs 1.4 crore was found in the Swatantrata Sangram Senani special train, a senior official said today.", "link": "https://www.ndtv.com/india-news/unclaimed-bag-with-rs-1-4-crore-cash-found-in-train-cops-investigate-2372803"},
{"title": "Terrorists Open Fire At Popular Dhaba In Srinagar, Injure Owner's Son", "text": "A suspected terrorist shot and injured a man inside Krishna Dhaba, popular eatery in Jammu and Kashmir's Srinagar on Wednesday evening", "link": "https://www.ndtv.com/india-news/jammu-and-kashmir-news-krishna-dhaba-srinagar-terrorists-open-fire-at-srinagar-dhaba-injure-owners-son-2372802"},
{"title": "Opposition Demands Puducherry Chief Minister To Prove Majority In Assembly", "text": "A delegation of opposition parties led by All India NR Congres or AINRC today submitted a plea to an official in the Lt Governor's office, seeking a direction to Puducherry Chief Minister V Narayanasamy to prove his government's majority on the floor of the Assembly.", "link": "https://www.ndtv.com/india-news/opposition-demands-puducherry-chief-minister-to-prove-majority-in-assembly-2372800"},
{"title": "Bihar Chief Minister Nitish Kumar Calls For Caste-Based Census", "text": "Bihar Chief Minister Nitish Kumar on Wednesday again voiced the demand for a caste-based census.", "link": "https://www.ndtv.com/india-news/bihar-chief-minister-nitish-kumar-calls-for-caste-based-census-2372787"},
{"title": "Jewellery Worth Rs 2.85 Crore Stolen From Shop In Mumbai", "text": "Gold and silver jewellery worth around Rs 2.85 crore has been stolen from a shop in central Mumbai, police said on Wednesday.", "link": "https://www.ndtv.com/india-news/jewellery-worth-rs-2-85-crore-stolen-from-shop-in-mumbai-2372786"},
{"title": "'Excellent Discussion': India, Russia Hold Talks Over Bilateral Issues", "text": "Foreign Secretary Harsh Vardhan Shringla had \"excellent discussion\" with Russia's Deputy Foreign Minister Igor Morgulov on Wednesday on bilateral issues, cooperation in multilateral organisations as well as regional and global issues of mutual interest.", "link": "https://www.ndtv.com/india-news/excellent-discussion-india-russia-hold-talks-over-bilateral-issues-2372780"},
{"title": "With New Covid Strains Reported In India, Fresh Guidelines For Travellers", "text": "A fresh set of travel guidelines has been issued as two new, more infectious strains of Covid -- the South African and the Brazilian strains -- have been detected in India. The new rules apply to all incoming international passengers except those from the UK, Europe and Middle East, the health ministry has said.", "link": "https://www.ndtv.com/india-news/as-new-covid-strains-surface-in-india-fresh-guidelines-for-incoming-travellers-2372779"},
{"title": "New Satellite Images Show China Vacating Military Camps At Ladakh", "text": "China has dismantled dozens of structures and moved vehicles to empty out entire camps along the Line of Actual Control (LAC) - the de facto border, where Indian and Chinese troops have been locked in a face-off since last summer, satellite images released on Wednesday show.", "link": "https://www.ndtv.com/india-news/new-satellite-images-show-china-vacating-military-camps-at-ladakh-2372775"},
{"title": "Normal Petrol's Price Crosses Rs 100 A Litre In Rajasthan's Sriganganagar", "text": "After premium petrol, the price of normal petrol has also crossed Rs 100 per litre in Rajasthan's Sriganganagar district.", "link": "https://www.ndtv.com/india-news/normal-petrols-price-crosses-rs-100-a-litre-in-rajasthans-sriganganagar-2372756"},
{"title": "Sri Lanka To Re-Acquire 99 Oil Tanks Leased To Indian Oil: Minister", "text": "Sri Lanka will re-acquire the World War II-era oil storage tanks leased out to Indian Oil Corporation in the eastern port district of Trincomalee, Energy Minister Udaya Gammanpila has said.", "link": "https://www.ndtv.com/india-news/sri-lanka-to-re-acquire-99-oil-tanks-leased-to-indian-oil-minister-2372754"},
{"title": "Kerala Doctors Remove Whistle Stuck In Woman's Respiratory System For 25 Years", "text": "Doctors at the government medical college in Kerala's Kannur have removed a tiny whistle from the respiratory system of a 40-year-old woman who had accidentally swallowed it in her teenage and was bothered by a racking cough for over two decades.", "link": "https://www.ndtv.com/india-news/kerala-doctors-remove-whistle-stuck-in-womans-respiratory-system-for-25-years-2372747"},
{"title": "Over 900 Alumni Of Bengaluru College Sign Support Letter For Disha Ravi", "text": "The support for 22-year-old climate activist Disha Ravi - arrested last week in the 'toolkit' case - is growing in her alma mater, Bengaluru's Mount Carmel College. A letter of solidarity that also condemns her arrest now has 900 signatories, up from 300 yesterday.", "link": "https://www.ndtv.com/india-news/support-for-disha-ravi-grows-900-sign-letter-at-mount-carmel-college-2372698"},
{"title": "'Very Poor' Air In Ghaziabad, Noida, Faridabad, Gurgaon For Third Straight Day", "text": "The average air quality across Ghaziabad, Noida, Greater Noida, Fridabad and Gurgaon was recorded \"very poor\", which may cause respiratory illness to people on prolonged exposure, for a third day in a row, according to data issued by a government agency on Wednesday.", "link": "https://www.ndtv.com/india-news/very-poor-air-in-ghaziabad-noida-faridabad-gurgaon-for-third-straight-day-2372743"},
{"title": "In Priya Ramani Order, Court Refers To Land Of Mahabharata, Ramayana", "text": "It is shameful that incidents of crime and violence against women are happening in a country where epics such as \"Mahabarata\" and \"Ramayana\" were written around the theme of respect for women, a Delhi court said on Wednesday.", "link": "https://www.ndtv.com/india-news/in-priya-ramani-order-court-refers-to-land-of-mahabharata-ramayana-2372741"},
{"title": "On Camera, Lawyer Couple Hacked To Death In Telangana", "text": "Shocking videos have emerged of a lawyer couple in Telangana's Peddapalli being hacked to death on a main road in broad daylight.", "link": "https://www.ndtv.com/india-news/on-camera-lawyer-couple-hacked-to-death-in-telangana-2372731"},
{"title": "PM, Mamata Banerjee's Focus On Bengal's Hooghly: 2 Rallies 2 Days Apart", "text": "Elections in Bengal inching closer, Chief Minister Mamata Banerjee and Prime Minister Narendra Modi will be holding rallies at the same ground in Hooghly district two days apart. The Prime Minister's rally is scheduled for February 22 at the Dunlop Grounds. Mamata Banerjee will be there two days later -- on February 24.", "link": "https://www.ndtv.com/india-news/bengal-assembly-elections-2021-pm-narendra-modi-mamata-banerjees-focus-on-bengals-hooghly-2-rallies-2-days-apart-2372724"},
{"title": "Labourer Thrashed To Death In UP, Accused On Run: Police", "text": "A labourer was beaten to death by a man allegedly over some dispute in Uttar Pradesh's Pilibhit, police said on Wednesday.", "link": "https://www.ndtv.com/india-news/pilibhit-labourer-thrashed-to-death-in-up-accused-absconding-police-2372722"},
{"title": "'Ray Of Hope': Bollywood Celebrates Priya Ramani's Acquittal In Defamation Case", "text": "Prominent Bollywood celebrities, including actors Taapsee Pannu, Richa Chadha, and filmmaker Onir, on Wednesday hailed journalist Priya Ramani's acquittal in MJ Akbar's criminal defamation case over allegations of sexual harassment.", "link": "https://www.ndtv.com/india-news/ray-of-hope-bollywood-celebrates-priya-ramanis-acquittal-in-defamation-case-2372720"},
{"title": "Number Of Deaths In Madhya Pradesh Bus Accident Rises To 51: Official", "text": "The number of deaths in the bus accident in Madhya Pradesh's Sidhi district has gone up to 51 with the recovery of four more bodies today, officials said.", "link": "https://www.ndtv.com/india-news/number-of-deaths-in-madhya-pradesh-bus-accident-rises-to-51-official-2372717"},
{"title": "Trinamool's Model Of Violence, Corruption Won't Work: Dinesh Trivedi", "text": "Former Union Minister Dinesh Trivedi, who recently quit the Trinamool Congress (TMC), has said the \"corruption and violence model\" of West Bengal's ruling party will no longer work for it and will take the state back to \"dark days\".", "link": "https://www.ndtv.com/india-news/trinamools-model-of-violence-corruption-wont-work-dinesh-trivedi-2372709"},
{"title": "No Data Yet On Efficacy of Covid Vaccines Against Virus Variants, Say Scientists: Report", "text": "Preliminary research shows the two vaccines against COVID-19 approved in India are effective against the UK variant of the novel coronavirus but there is no data on their efficacy against the South African and Brazilian mutants detected in the country.", "link": "https://www.ndtv.com/india-news/no-data-yet-on-efficacy-of-covid-19-vaccines-against-virus-variants-say-scientists-report-2372700"},
{"title": "Rahul Gandhi Calls For Fisheries Ministry. Minister's Retort In Italian", "text": "Rahul Gandhi, addressing fishermen during his visit to Puducherry today, called them \"farmers of the sea\" and talked about a separate ministry for fisheries. Except there already is one, the ruling BJP soon pointed out.", "link": "https://www.ndtv.com/india-news/rahul-gandhi-calls-for-fisheries-ministry-minister-giriraj-singhs-retort-in-italian-2372682"},
{"title": "Cabinet Approves Trade Pact Between India, Mauritius", "text": "The Union Cabinet on Wednesday approved signing of a comprehensive economic cooperation agreement, a kind of a free trade pact, between India and Mauritius which is aimed at liberalising norms to boost two-way commerce.", "link": "https://www.ndtv.com/india-news/cabinet-approves-trade-pact-between-india-mauritius-2372671"},
{"title": "COVID-19: Mumbai Mayor Travels In Train To Spread Awareness About Masks", "text": "Mumbai Mayor Kishori Pednekar travelled in a local train to spread awareness about the use of face masks among citizens in the wake of the rising COVID-19 cases in the city.", "link": "https://www.ndtv.com/india-news/coronavirus-mumbai-mayor-travels-in-local-train-to-spread-awareness-about-masks-2372670"},
{"title": "How Is India Beating COVID-19? 'Human Barricade', Say Experts", "text": "With falling rates of COVID-19 infection in India and surveys suggesting nearly 300 million people may already have antibodies, some experts believe the worst of the disease has passed, despite a recent uptick in two hard-hit states.", "link": "https://www.ndtv.com/india-news/how-is-india-beating-covid-19-human-barricade-say-experts-2372662"},
{"title": "Indians Should Be Able to Buy Vaccine By March: Apollo Boss", "text": "India's largest health care chain expects a private market for Covid-19 vaccines to open up across the country within weeks, a move that may boost current government efforts to inoculate 300 million people by August.", "link": "https://www.ndtv.com/india-news/indians-should-be-able-to-buy-vaccine-by-march-apollo-boss-suneeta-reddy-2372658"},
{"title": "Congress, Left Have No Relevance In Bengal: Babul Supriyo", "text": "As Congress-Left alliance gears up to fight the Assembly polls in West Bengal, Union Minister and BJP leader Babul Supriyo on Wednesday said these political parties have no relevance in the state.", "link": "https://www.ndtv.com/india-news/congress-left-have-no-relevance-in-bengal-babul-supriyo-2372656"},
{"title": "'I Forgive...': Rahul Gandhi When Asked About His Father's Killers", "text": "Congress MP Rahul Gandhi on Wednesday said he felt \"tremendous pain but no anger\" to those who assassinated his father - former Prime Minister Rajiv Gandhi - and that he \"forgave\" them", "link": "https://www.ndtv.com/india-news/puducherry-assembly-election-i-forgive-rahul-gandhi-when-asked-about-his-father-rajiv-gandhis-killers-2372645"},
{"title": "'Fraudulent Elements Taking Money In ", "text": "Maharashtra Chief Minister Uddhav Thackeray has taken a veiled swipe at the BJP, saying Shiv Sena workers should make people aware about \"fraudulent elements\" who are collecting money in the name of Lord Ram.", "link": "https://www.ndtv.com/india-news/make-people-aware-of-fraudulent-elements-taking-money-in-rams-name-uddhav-thackeray-2372630"},
{"title": "UP Assembly's Budget Session Begins Tomorrow", "text": "The Budget Session of the Uttar Pradesh legislature will begin with Governor Anandiben Patel's address to a joint sitting of both houses on Thursday.", "link": "https://www.ndtv.com/india-news/up-assemblys-budget-session-begins-tomorrow-2372620"},
{"title": "Priya Ramani Acquitted In Defamation Case Filed By MJ Akbar: A Timeline", "text": "Priya Ramani acquitted in defamation case filed by MJ Akbar: \"It feels amazing, truly does. I feel vindicated on behalf of all the women who have ever spoken out against sexual harassment at work place,\" Priya Ramani said. Here is the timeline of the case.", "link": "https://www.ndtv.com/india-news/priya-ramani-acquitted-in-defamation-case-filed-by-mj-akbar-timeline-of-case-2372615"},
{"title": "PM's Attack On 'Earlier' Governments As Petrol Breaches Rs 100 Per Litre", "text": "On a day when petrol crossed the Rs 100 mark, Prime Minister Narendra Modi on Wednesday said the middle-class would not have been burdened if the previous governments had focussed on reducing India's energy import dependence.", "link": "https://www.ndtv.com/india-news/reducing-import-dependence-says-prime-minister-narendra-modi-as-petrol-breaches-rs-100-mark-2372613"},
{"title": "Cabinet Nod To Juvenile Justice Law Amendments", "text": "The Union Cabinet on Wednesday approved amendments to the Juvenile Justice (Care and Protection of Children) Act 2015, increasing the role of district magistrates and additional district magistrates.", "link": "https://www.ndtv.com/india-news/cabinet-nod-to-juvenile-justice-law-amendments-2372610"},
{"title": "Despite Industry's Appeals, Private Sector Not Part Of Vaccine Drive Yet", "text": "One month after banker Uday Kotak wrote to Prime Minister Narendra Modi as president of the Confederation of Indian Industry (CII), the private sector has still not been involved in Covid vaccinations across the country.", "link": "https://www.ndtv.com/india-news/cii-chief-uday-kotak-to-pm-narendra-modi-involve-private-sector-in-vaccinations-2372602"},
{"title": "Youth Congress Workers Protest Against Fuel Price Hike In Delhi", "text": "A group of Indian Youth Congress (IYC) activists staged a demonstration at Connaught Place on Wednesday against rising prices of petrol, diesel and cooking gas, and demanded that the government roll back the hike.", "link": "https://www.ndtv.com/india-news/petrol-price-hike-protest-youth-congress-activists-protest-against-fuel-price-hike-in-delhi-2372588"},
{"title": "Railways Deploys Additional Forces In 4 States Ahead Of ", "text": "The railways has deployed 20 additional companies of the Railway Protection Special Force (RPSF) across the country, with focus on Punjab, Haryana, Uttar Pradesh and West Bengal, in the wake of the \"rail roko\" stir called on Thursday by farmer groups protesting against the Centre's new agri laws.", "link": "https://www.ndtv.com/india-news/additional-railway-protection-special-force-troops-deployed-ahead-of-rail-roko-tomorrow-2372583"},
{"title": "Amid Congress' Numbers Crisis, Rahul Gandhi In Puducherry Ahead Of Polls", "text": "Rahul Gandhi is in Puducherry today - he began the day by meeting fishermen, whom he praised as \"farmers of the sea\" and with whom he expressed a desire to travel on one of their trips - to launch the Congress campaign for Assembly polls in May.", "link": "https://www.ndtv.com/india-news/day-after-kiran-bedis-removal-rahul-gandhi-in-puducherry-to-campaign-for-polls-2372576"},
{"title": "Nursery Admission In Delhi Begins Tomorrow, Registration Closes On March 4", "text": "Delhi nursery admission 2021: The process for nursery admissions in schools across the national capital will begin from Thursday and the application window will close on March 4.", "link": "https://www.ndtv.com/delhi-news/delhi-nursery-admission-2021-from-february-18-important-points-2372575"},
{"title": "Rahul Gandhi Meets Puducherry Fishermen Before Polls, Asks For A 'Favour'", "text": "Congress leader Rahul Gandhi on Wednesday interacted with members of fishermen community here and expressed his wish to travel along with them in their boats to see for himself and understand better their travails.", "link": "https://www.ndtv.com/india-news/rahul-gandhi-meets-puducherry-fishermen-before-polls-asks-for-a-favour-2372566"},
{"title": "Smriti Irani's Reaction To Court Order Acquitting Journalist Priya Ramani", "text": "Union Minister Smriti Irani, reacting to the Delhi court order acquitting journalist Priya Ramani in a defamation suit filed by former minister MJ Akbar, said today that \"due protection had been given to women\" by law.", "link": "https://www.ndtv.com/india-news/smriti-iranis-reaction-to-court-order-acquitting-journalist-priya-ramani-2372564"},
{"title": "'Stellar Reputation' Argument Among Those MJ Akbar Made - And Lost", "text": "Former Union Minister MJ Akbar's defamation case against journalist Priya Ramani was dismissed today by a court that \"even a man of social status\" can be a sexual harasser.", "link": "https://www.ndtv.com/india-news/stellar-reputation-argument-among-those-mj-akbar-made-and-lost-2372561"},
{"title": "Centre Asked To Reply To Letter Linking Chardham Project To Glacier Burst", "text": "The Supreme Court today allowed the Centre to respond to the \"allegations\" of the Chairman of committee on Chardham project linking broadening of the road to the recent flash floods on Dhauliganga river, which damaged the Tapovan hydro project in Uttarakhand.", "link": "https://www.ndtv.com/india-news/top-court-allows-centre-to-reply-to-letter-linking-chardham-project-to-glacier-burst-2372556"},
{"title": "Events At The Border Illustrative Of A Confident India: PM Modi", "text": "India is brimming with confidence, and the events on the borders and the government's decision to liberalise geospatial data are representative of the same, Prime Minister Narendra Modi said today.", "link": "https://www.ndtv.com/india-news/events-at-the-border-illustrative-of-a-confident-india-pm-narendra-modi-2372553"},
{"title": "Time To Renew 'Unique' India-US Partnership That Can Benefit A Fifth Of Humanity: Envoy", "text": "As the world confronts the COVID-19 pandemic and an economic slowdown, it is time to renew the promise of a \"unique partnership\" between India and America that can directly benefit a fifth of humanity, India's ambassador to the US Taranjit Singh Sandhu has said.", "link": "https://www.ndtv.com/india-news/time-to-renew-unique-india-us-partnership-that-can-benefit-a-fifth-of-humanity-envoy-2372549"},
{"title": "Congress Students' Wing Protests Against Disha Ravi's Arrest", "text": "The National Students' Union of India (NSUI) staged an agitation here on Wednesday against the arrest of environment activist Disha Ravi and alleged that the government is \"flirting with fascistic techniques\" to quell democratic protests in the country.", "link": "https://www.ndtv.com/india-news/congress-students-wing-protests-against-disha-ravis-arrest-2372537"},
{"title": "Watch: Priya Ramani Reacts To Big Verdict vs MJ Akbar", "text": "Journalist Priya Ramani, acquitted in the defamation case filed by former Union Minister MJ Akbar, today said she feels \"vindicated on behalf of all the women who have ever spoken out against sexual harassment in the workplace\".", "link": "https://www.ndtv.com/india-news/priya-ramani-to-ndtv-on-delhi-court-verdict-i-hope-it-will-make-more-women-speak-up-2372523"},
{"title": "2 Claiming To Be Cops Take Hard Disk From Activist Shantanu Muluk's Home Over 'Toolkit': Report", "text": "Two persons claiming to be the personnel of Delhi Police seized a computer hard disk and other items from the house of activist Shantanu Muluk, a suspect in the \"toolkit\" case related to the farmers' protest, without a search warrant on February 12, in Beed in Maharashtra, his father Shivlal Muluk has told local police.", "link": "https://www.ndtv.com/india-news/2-claiming-to-be-cops-take-hard-disk-from-activist-shantanu-muluks-home-over-toolkit-report-2372506"},
{"title": "On KCR's Birthday, PM Modi, Telugu Star Mahesh Babu And Others Greet Him", "text": "Telangana Chief Minister K Chandrasekhar Rao celebrated his 68th birthday today. Prime Minister Narendra Modi, union ministers, chief ministers of other states greeted KCR on his borthday.", "link": "https://www.ndtv.com/india-news/on-k-chandrasekhar-raos-birthday-pm-modi-telugu-star-mahesh-babu-others-greet-the-telangana-chief-minister-2372503"},
{"title": "5 Big Points From Delhi Court Verdict Acquitting Priya Ramani", "text": "Journalist Priya Ramani was acquitted by a Delhi court Wednesday afternoon over a defamation case filed by former Union Minister MJ Akbar, whom she had accused of sexual misconduct in 2018. A year earlier Vogue India published an article by Ms Ramani, in which she described an incident with a \"former boss\" and a \"sexual predator\". In October 2018, Ms Ramani named MJ Akbar - then a minister in Prime Minister Narendra Modi's government - in a tweet. A week later MJ Akbar filed the criminal defamation case and resigned as minister two days later. The trial began in January 2019, and today's verdict was read out by Additional Chief Metropolitan Magistrate Ravindra Kumar Pandey.", "link": "https://www.ndtv.com/india-news/priya-ramani-defamation-case-mj-akbar-priya-ramani-acquitted-in-defamation-case-5-big-observations-by-court-2372490"},
{"title": "Threatened For Money For Ram Temple Donation, HD Kumaraswamy Alleges", "text": "After causing a sensation with his comments comparing the Rashtriya Swayamsevak Sangh (RSS) to the Nazis, HD Kumaraswamy today tweaked his words and raised a fresh allegation.", "link": "https://www.ndtv.com/india-news/hd-kumaraswamy-alleges-threatened-for-money-for-ram-temple-donation-2372440"},
{"title": "Sourav Ganguly's Wife Dona Files Police Complaint Over Fake Facebook Page", "text": "Cricket icon Sourav Ganguly's wife Dona Ganguly lodged a police complaint about a fake Facebook page in her name, an officer said today.", "link": "https://www.ndtv.com/india-news/sourav-gangulys-wife-dona-files-police-complaint-over-fake-facebook-page-report-2372478"},
{"title": "Journalist Priya Ramani Acquitted In Defamation Case Filed By MJ Akbar", "text": "Former Union Minister MJ Akbar's defamation case against journalist Priya Ramani -- filed over her allegations of sexual misconduct against him -- could not be proved, a Delhi Court said today, acquitting her of all charge", "link": "https://www.ndtv.com/india-news/priya-ramani-acquitted-in-defamation-case-filed-by-former-union-minister-mj-akbar-she-had-accused-him-of-sex-harassment-2372467"},
{"title": "Foreign Envoys Begin Two-Day Kashmir Visit Amid Shutdown", "text": "Envoys of 22 countries today began their two-day visit to Jammu And Kashmir amid heightened security and a shutdown in several parts of the Valley. This is the fourth such visit since the Centre scrapped the former state's special constitutional position and divided it into two Union Territories.", "link": "https://www.ndtv.com/india-news/foreign-envoys-begin-two-day-kashmir-visit-amid-shutdown-2372463"},
{"title": "Petrol Crosses Rs 100-Mark In Rajasthan, First Time Ever In India", "text": "For the first time ever, the price of petrol crossed the Rs 100 per litre mark in Rajasthan today after fuel rates were hiked for the ninth day in a row.", "link": "https://www.ndtv.com/india-news/petrol-crosses-rs-100-mark-in-rajasthan-first-time-ever-in-india-2372442"},
{"title": "India's Startup Founders Should Create Institutions, Not Just Valuations: PM Modi", "text": "Prime Minister Narendra Modi today urged India's startup founders to think how to create institutions and not focus on valuations alone.", "link": "https://www.ndtv.com/india-news/indias-startup-founders-should-create-institutions-not-just-valuations-pm-modi-2372433"},
{"title": "Hailstorm Likely In Vidarbha, Parts Of Maharashtra In Next 2 Days", "text": "Weather update: Hailstorms are likely at some places in Vidarbha and Marathwada regions of Maharashtra in the next two days in view of the moisture-laden winds from the Bay of Bengal, an official of the India Meteorological Department said on Wednesday.", "link": "https://www.ndtv.com/india-news/hailstorm-likely-in-vidarbha-parts-of-maharashtra-in-next-2-days-2372430"},
{"title": "'Wasn't Attacked For Having Opinion': Actor Siddharth Shares 2009 Video", "text": "Actor Siddharth, a vocal critic of the BJP government, shared a video of him from 2009 speaking at a business school and said that he was \"not attacked for having an opinion\" back then adding that the country \"has changed\".", "link": "https://www.ndtv.com/india-news/actor-siddharth-shares-2009-video-says-wasnt-attacked-for-having-opinion-2372420"},
{"title": "Explained: Kiran Bedi's Sudden Removal As Puducherry Lt Governor", "text": "Kiran Bedi's sacking as Lieutenant Governor of Puducherry last evening, with the state government on the brink, surprised many but top sources say the decision was not as abrupt as it seems.", "link": "https://www.ndtv.com/india-news/puducherry-crisis-kiran-bedi-sudden-removal-as-lieutenant-governor-explained-2372415"},
{"title": "When Chips Were Down, You Kept Things Running: PM Praises IT Industry", "text": "Lauding the performance of the country's information technology (IT) industry during the COVID-19 pandemic, Prime Minister Narendra Modi on Wednesday said \"when the chips were down, your (industry) core kept things running.\"", "link": "https://www.ndtv.com/india-news/prime-minister-narendra-modi-praises-it-industry-says-when-chips-were-down-you-kept-things-running-2372391"},
{"title": "India, Russia Agree To Work Closely On Key Issues At UN Security Council", "text": "India and Russia have agreed to work closely on key issues at the UN Security Council, in keeping with the special and privileged strategic partnership between the two countries.", "link": "https://www.ndtv.com/india-news/india-russia-agree-to-work-closely-on-key-issues-at-un-security-council-2372407"},
{"title": "No COVID-19 Deaths In Last 24 Hours In 18 States, Union Territories: Centre", "text": "Eighteen states and Union Territories, including Uttar Pradesh, Rajasthan and Andhra Pradesh, have not reported any death due to COVID-19 in the last 24 hours, the Union health ministry said today.", "link": "https://www.ndtv.com/india-news/no-covid-19-deaths-in-last-24-hours-in-18-states-union-territories-health-ministry-2372393"},
{"title": "UP, Madhya Pradesh To Be Parties To Plea Against Anti-Conversion Laws Over Marriage", "text": "The Supreme Court today permitted an NGO to make Himachal Pradesh and Madhya Pradesh as parties to a pending petition challenging the controversial state laws regulating conversions due to inter-faith marriages.", "link": "https://www.ndtv.com/india-news/up-madhya-pradesh-to-be-parties-to-plea-against-anti-conversion-laws-over-marriage-2372386"},
{"title": "Lucknow Man Builds Robot To Take Care Of Blind And Deaf Dog", "text": "A deaf and blind dog in Lucknow got a new lease of life after a man built a robot to take care of him. Milind Raja, a robot enthusist, rescued the dog during the pandemic-forced lockdown and brought him home. He built a robot to feed the dog when he's not at home.", "link": "https://www.ndtv.com/india-news/lucknow-man-builds-robot-to-take-care-of-blind-and-deaf-dog-2372359"},
{"title": "Foreign Envoys, Including From European Union, Visit J&K To Assess Situation", "text": "A delegation of 24 ambassadors to India, including those from France, European Union and Malaysia, arrived in Srinagar on a two-day visit to Jammu and Kashmir for making an assessment of the situation post the scrapping of the erstwhile state's special status in 2019.", "link": "https://www.ndtv.com/india-news/foreign-envoys-including-from-european-union-visit-j-k-to-assess-situation-2372354"},
{"title": "Devotee Donates Over 4 Kg Gold, 3 Kg Silver To Puri Jagannath Temple", "text": "A devotee of Lord Jagannath has donated over 4 kg gold and 3 kg silver jewellery for the trinity - Lord Balabhadra, Devi Subhadra and Lord Jagannath, on the occasion of Shree Panchami, Shree Jagannath Temple Administration (SJTA) said.", "link": "https://www.ndtv.com/india-news/devotee-donates-over-4-kg-gold-3-kg-silver-to-puri-jagannath-temple-2372330"},
{"title": "Toolkit Case: Bombay High Court Holds Nikita Jacob's Arrest For 3 Weeks", "text": "The Bombay High Court today granted Mumbai lawyer and environmental activist Nikita Jacob transit bail for three weeks in connection with an case filed by the Delhi police in connection with the Toolkit matter. In case of arrest, she will be released on a personal bond of Rs 25,000 and one surety of like amount.", "link": "https://www.ndtv.com/india-news/mumbai-lawyer-nikita-jacob-wanted-in-toolkit-case-gets-protection-from-arrest-for-three-weeks-from-bombay-high-court-2372316"},
{"title": "Number Of Deaths In Madhya Pradesh Bus Accident Rises To 49: Cops", "text": "The number of deaths in the bus accident in Madhya Pradesh's Sidhi district has gone up to 49 with the recovery of two more bodies this morning, police said.", "link": "https://www.ndtv.com/india-news/number-of-deaths-in-madhya-pradesh-bus-accident-rises-to-49-cops-2372312"},
{"title": "No Link Between Char Dham Road Widening And Glacier Burst Tragedy: Centre", "text": "The Central government today told the Supreme Court that there was no connection between the massive ongoing Char Dham road-widening project and the glacier burst earlier this month that resulted in the death of a number of people in Uttarakhand.", "link": "https://www.ndtv.com/india-news/no-link-between-char-dham-road-widening-and-glacier-burst-tragedy-centre-2372307"},
{"title": "Foreign Secretary Harsh Vardhan Shringla Arrives In Russia For 2-Day Visit", "text": "Foreign Secretary Harsh Vardhan Shringla has arrived in Moscow for talks with top Russian officials, and to add momentum to the India-Russia special and privileged strategic partnership and exchange views on topical issues of regional and international importance.", "link": "https://www.ndtv.com/india-news/foreign-secretary-harsh-vardhan-shringla-arrives-in-russia-for-2-day-visit-2372282"},
{"title": "Government 'Overconfident': Rahul Gandhi As 2 More Covid Strains Reported", "text": "The government is being \"grossly negligent\" and \"over confident\" about the coronavirus pandemic in the country, Congress leader Rahul Gandhi said today continuing his attacks on the centre on Twitter.", "link": "https://www.ndtv.com/india-news/government-overconfident-rahul-gandhi-as-2-more-covid-strains-reported-2372280"},
{"title": "Goddess Saraswati Crowns A Health Worker At A Bengal Pandal. See Pic", "text": "On Saraswati Puja, in West Bengal amid the Covid-19 pandemic, the goddess of knowledge and wisdom was seen 'crowning' a 'corona warrior'. Saraswati Puja ends today with immersion of the idols.", "link": "https://www.ndtv.com/india-news/goddess-saraswati-crowns-a-corora-warrior-at-a-bengal-pandal-see-pic-2372241"},
{"title": "'Does PM Support Corruption By Holding Tainted Hands?' DMK's MK Stalin", "text": "Prime Minister Narendra Modi on Sunday held the hands of the ruling AIADMK's two top leaders and raised them, in a politically significant gesture ahead of the approaching election in Tamil Nadu. All three, PM Modi, Chief Minister E Palaniswami and his deputy O Panneerselvam, stood on the stage with their linked hands held high.", "link": "https://www.ndtv.com/india-news/tamil-nadu-election-2021-dmk-mk-stalin-says-does-pm-narendra-modi-support-corruption-by-holding-tainted-hands-2372197"},
{"title": "Weather Update: Visibility Affected Due To Dense Fog In Parts Of North India", "text": "Weather update: People in parts of Punjab, Haryana, Delhi, and Rajasthan woke up to dense fog on Wednesday morning. Fog was also reported in Odisha.", "link": "https://www.ndtv.com/india-news/visibility-affected-due-to-thick-fog-in-parts-of-north-india-2372166"},
{"title": "Congress Sweeps Punjab Urban Polls. Amarinder Singh Says '2022 Teaser'", "text": "The Congress party today made a clean sweep of Punjab's seven municipal corporations in the state local body polls. The party bagged all the bodies for which the results were declared today: Moga, Hoshiarpur, Kapurthala, Abohar, Pathankot, Batala, and Bathinda - the last one also being the most stunning result of the day as it was after 53 years that the city was returning to the Congress fold. Mohali's results will be declared only tomorrow. The spectacular success prompted Chief Minister Amarinder Singh to claim that the results offered a foretaste of what was to come in a year from now when the state assembly polls will be held.", "link": "https://www.ndtv.com/india-news/amid-farmer-protest-punjab-awaits-local-body-poll-results-today-2372221"},
{"title": "'His Sword Dancing Motivated Protesters': Red Fort Case Accused Arrested", "text": "Maninder Singh, one of the most wanted people in the Red Fort violence that took place on January 26, has been arrested by Delhi Police Special Cell.", "link": "https://www.ndtv.com/india-news/red-fort-violence-case-prime-accused-maninder-singh-arrested-swords-recovered-2372189"},
{"title": "After Journalists' Strike, Manipur To Probe Attack On Newspaper Office", "text": "Days after all newspapers in Manipur stopped publication following an attack on a leading daily's office, Chief Minister N Biren Singh announced that a Special Investigation Team (SIT) will probe the grenade attack. The office of Imphal-based daily newspaper \"Poknapham\" was targeted last Sunday but no one was injured, police sources said.", "link": "https://www.ndtv.com/india-news/after-journalists-strike-manipur-n-biren-singh-to-probe-attack-on-poknapham-newspaper-office-2372216"},
{"title": "In Government Vs Twitter, Made-In-India Koo Gains 900,000 Users In 5 Days", "text": "An Indian alternative to Twitter Inc. is experiencing a surge in popularity after the US microblogging site clashed with the government, a sign of the growing political challenges for social media services.", "link": "https://www.ndtv.com/india-news/in-government-vs-twitter-made-in-india-koo-gains-900-000-users-in-5-days-2372203"},
{"title": "Srinagar Temple, Shut Due To Terrorism For 31 Years, Reopens", "text": "A temple in Srinagar, which closed its doors for devotees 31 years ago due to militancy and outmigration of Hindus, was reopened on the auspicious occasion of Basant Panchami.", "link": "https://www.ndtv.com/india-news/srinagar-temple-shut-due-to-terrorism-for-31-years-reopens-2372132"},
{"title": "Punjab Municipal Election Results 2021 Live Updates: Congress Sweeps Punjab Urban Body Polls", "text": "The Congress party has won all the seven municipal corporations in Punjab for which the results were declared today. The party has won Abohar, Bathinda, Kapurthala, Hoshiarpur, Pathankot, Moga and Batla.", "link": "https://www.ndtv.com/india-news/punjab-municipal-election-results-2021-live-updates-2372183"},
{"title": "'Whatever Was Done Was A Sacred Duty': Kiran Bedi's Farewell Note", "text": "Kiran Bedi thanked the government for a \"life time experience\" as the Lieutenant-Governor of Puducherry, after she was removed from the top post last night amid a crisis in the ruling Congress government in the union territory. The Congress government has slipped into a minority after four Congress leaders resigned from the Assembly since last month.", "link": "https://www.ndtv.com/india-news/puducherry-crisis-kiran-bedi-thanks-government-for-life-time-experience-in-puducherry-2372170"},
{"title": "Foreign Envoys On 2-Day J&K Visit From Today, To Meet Lt Governor", "text": "Envoys from Europe and Africa will visit Jammu and Kashmir on Wednesday to assess the development work and the security situation in the union territory, especially after the successful completion of the District Development Council elections, officials said on Tuesday.", "link": "https://www.ndtv.com/india-news/foreign-envoys-on-2-day-jammu-and-kashmir-visit-from-today-to-meet-lt-governor-officials-2372163"},
{"title": "Latest News Highlights: India Reports 11,610 New COVID-19 Cases, 100 Deaths In Last 24 Hours", "text": "With 11,610 fresh cases, India's COVID-19 tally has climbed to 1,09,37,320, while the number of recoveries has surged to 1,06,44,858, the Union health ministry said on Wednesday.", "link": "https://www.ndtv.com/india-news/latest-news-live-updates-over-87-lakh-covid-19-vaccine-doses-administered-in-india-2372114"},
{"title": "India Says UN Must Focus On Eliminating Threats By Terror Groups In Iraq", "text": "Expressing serious concerns on the terrorist attacks that took place last month in Baghdad, Iraq, India on Tuesday said that the United Nations Security Council (UNSC) should focus on eliminating every threat posed by the Islamic State of Iraq and the Levant (ISIL) and other terror groups in Iraq and elsewhere in the world.", "link": "https://www.ndtv.com/india-news/india-says-united-nations-security-council-must-focus-on-eliminating-threats-by-terror-groups-in-iraq-2372097"},
{"title": "UN Peacekeeping Missions Should Not Be For 'Political Interests': India", "text": "The United Nations (UN) peacekeeping missions should not operate in perpetuity and there is an urgent need for time-bound exit strategies to ensure they do not become instruments for \"furthering political interests\", India, one of the largest troop-contributing countries, has said.", "link": "https://www.ndtv.com/india-news/un-peacekeeping-missions-should-not-be-for-political-interests-india-2372088"},
{"title": "Kangana Ranaut Withdraws Suit Against Notice Over Merged Flats", "text": "Bollywood actor Kangana Ranaut on Tuesday withdrew her suit filed in a civil court here against the notice issued by the Municipal Corporation of Greater Mumbai for alleged illegal merger of flats.", "link": "https://www.ndtv.com/india-news/kangana-ranaut-withdraws-suit-against-notice-over-merged-flats-2372079"},
{"title": "India's Fight Against COVID-19 Is Inspiring World: PM Narendra Modi", "text": "India's fight against COVID-19 is inspiring the world, though at the beginning of the pandemic other countries worried about the country's situation, Prime Minister Narendra Modi said on Tuesday.", "link": "https://www.ndtv.com/india-news/indias-fight-against-covid-19-is-inspiring-world-pm-narendra-modi-2372076"},
{"title": "Trinamool MLA's House, Office Vandalised In West Bengal's Malda", "text": "Trinamool Congress (TMC) MLA Nihar Ranjan Ghosh's house and the party office in Malda were allegedly vandalised by unidentified people on Monday night.", "link": "https://www.ndtv.com/india-news/trinamool-congress-mla-nihar-ranjan-ghosh-house-office-vandalised-in-west-bengals-malda-2372071"},
{"title": "Adverse Event Cases After Coronavirus Vaccination Just 1 In 2,000: Centre", "text": "Just one out of 2,000 beneficiaries report minor effects post vaccination against COVID-19, the Centre said on Tuesday, noting that the rate of adverse event following immunisation has been recorded at 0.05 per cent.", "link": "https://www.ndtv.com/india-news/adverse-event-cases-after-coronavirus-vaccination-just-1-in-2-000-centre-2372057"},
{"title": "Top UN Climate Official Speaks To PM Modi, Discusses India-UK Collaboration", "text": "President-designate of the 26th UN Climate Change Conference of the Parties (COP26) and British MP Alok Sharma called on Prime Minister Narendra Modi on Tuesday during which they discussed the India-UK collaboration on climate change issues in the run up to the crucial meet.", "link": "https://www.ndtv.com/india-news/top-un-climate-official-speaks-to-pm-modi-discusses-india-uk-collaboration-2372051"},
{"title": "False Propaganda Over Farm Laws, They Benefit Small Farmers: PM Modi", "text": "Accusing the opposition of false propaganda against the new agri-marketing legislation, Prime Minister Narendra Modi on Tuesday claimed that those who had made laws for bringing in foreign firms are now creating a scare among farmers over local companies.", "link": "https://www.ndtv.com/india-news/false-propaganda-over-farm-laws-they-benefit-small-farmers-pm-narendra-modi-2372042"},
{"title": "Delhi Records 94 New COVID-19 Cases, Lowest In Over 9 Months: Government", "text": "Delhi recorded 94 fresh COVID-19 cases today, the lowest in over nine months, while the positivity rate slipped to 0.17 per cent in the city, authorities said.", "link": "https://www.ndtv.com/delhi-news/delhi-records-94-new-covid-19-cases-lowest-in-over-9-months-government-2372032"},
{"title": "RT-PCR Covid Test Mandatory For Travellers From Brazil, South Africa In Bengaluru", "text": "The Karnataka government on Tuesday made RT-PCR test for international travellers, who have visited or transited through Brazil or South Africa during their journey, mandatory upon arrival at Bengaluru airport.", "link": "https://www.ndtv.com/india-news/rt-pcr-covid-test-mandatory-people-from-brazil-south-africa-at-bengaluru-airport-2372030"},
{"title": "'Formal Objection Conveyed': Nepal On Biplab Deb's 'BJP Expansion' Remark", "text": "Nepal Foreign Minister Pradeep Gyawali on Tuesday said that his country has conveyed a \"formal objection\" against Tripura Chief Minister Biplab Kumar Deb's remarks that Bharatiya Janata Party (BJP) has planned to expand in neighbouring countries like Nepal and Sri Lanka.", "link": "https://www.ndtv.com/india-news/nepal-on-biplab-debs-bjp-expansion-remark-formal-objection-conveyed-2372023"},
{"title": "2 Members Of Popular Front Of India Arrested With Explosives In UP: Cops", "text": "Two members of the Popular Front of India (PFI), planning a series of terrorist attacks at various places in the country, were arrested by the Special Task Forces in the state capital on Friday with a huge quantity of high quality explosives, a senior official said in Lucknow.", "link": "https://www.ndtv.com/india-news/uttar-pradesh-lucknow-2-members-of-popular-front-of-india-arrested-with-explosives-police-2372016"},
{"title": "Haryana To Bring Cancer, HIV Patients Under Ambit Of Social Security Pension Scheme", "text": "The Haryana government will bring patients of the state suffering from cancer, HIV and serious kidney ailments under the ambit of its social security pension scheme.", "link": "https://www.ndtv.com/india-news/haryana-to-bring-cancer-hiv-patients-under-ambit-of-social-security-pension-scheme-2372010"},
{"title": "Parents Crowdfund Rs 16 Crore To Treat 5-Month-Old Daughter, Thank Donors", "text": "Tira Kamat, a five-month-old Mumbai infant, has been suffering since birth from spinal muscular atrophy -- a rare genetic condition that leads to the loss of muscles (skeletal muscles) needed for movement. Her middle-class parents couldn't afford a Rs 22-crore injection required for her medical treatment.", "link": "https://www.ndtv.com/india-news/mumbai-parents-crowdfund-rs-16-crore-to-treat-5-month-old-daughter-thank-donors-2372008"},
{"title": "Follow Covid Norms Or Face New Lockdown, Warns Maharashtra Chief Minister", "text": "Concerned over the recent surge in COVID-19 cases in Maharashtra, Chief Minister Uddhav Thackeray on Tuesday asked citizens to strictly follow government-mandated guidelines on masks and social distancing or be prepared to face another round of lockdown.", "link": "https://www.ndtv.com/india-news/follow-covid-19-norms-or-face-new-lockdown-warns-maharashtra-chief-minister-uddhav-thackeray-2372005"},
{"title": "BJP Has Different Standard For Hate Speech From Partymen: Omar Abdullah", "text": "The BJP has a completely different standard when it comes to hate speech from its leaders, National Conference vice president Omar Abdullah alleged on Tuesday.", "link": "https://www.ndtv.com/india-news/bjp-has-different-standard-for-hate-speech-from-partymen-omar-abdullah-2372001"},
{"title": "'Operation Lotus' Reached Puducherry: Chief Minister To NDTV Amid Crisis", "text": "The Congress government in Puducherry has slipped into a minority with two resignations in two days but Chief Minister V Narayanasamy said on Tuesday he was confident of persuading the two leaders to stay. \"Our government is not in a minority,\" he asserted in an interview to NDTV.", "link": "https://www.ndtv.com/india-news/operation-lotus-reached-puducherry-chief-minister-v-narayanasamy-to-ndtv-amid-crisis-2371980"},
{"title": "Supreme Court Upholds Life Term For Man Who Killed 2 Children With Pest Control Fumigant", "text": "The Supreme Court today upheld life imprisonment to a man for killing two minors by giving them celphos, a pest control fumigant.", "link": "https://www.ndtv.com/india-news/supreme-court-upholds-life-term-for-man-who-killed-2-children-with-pest-control-fumigant-2371978"},
{"title": "Kiran Bedi Removed As Puducherry Lt Governor Amid Congress Crisis: 10 Points", "text": "The removal of Kiran Bedi as Lieutenant-Governor of Puducherry is \"a victory for the people\", Chief Minister V Narayanasamy told NDTV late Tuesday night, shortly after Rashtrapati Bhavan withdrew Ms Bedi from the post. The order, which comes as the ruling Congress navigates a crisis of numbers, has been widely seen as a political move by the BJP to negate their rivals' primary campaign platform and further weaken them ahead of elections in May. It also comes hours after a fourth Congress leader resigned from the Assembly, leaving Mr Narayanasamy's government on the brink of collapse. Mr Narayanasamy, however, has dismissed such talk and stressed: \"Our government is not in the minority.\"", "link": "https://www.ndtv.com/india-news/kiran-bedi-removed-as-puducherry-lieutenant-governor-amid-crisis-in-congress-government-2371971"},
{"title": "Lion Severely Injured After Being Hit By Goods Train In Gujarat: Official", "text": "A lion was severely injured after it was hit by a goods train today near Rajula town in Gujarat's Amreli district, an official said.", "link": "https://www.ndtv.com/india-news/lion-severely-injured-after-being-hit-by-goods-train-in-gujarat-forest-official-2371963"},
{"title": "Sedition Law Can't Be Used To 'Quieten The Disquiet': Delhi Court", "text": "The sedition law cannot be used to \"quieten the disquiet under the pretence of muzzling miscreants\", a court in Delhi said while granting bail to two men accused of posting fake videos on Facebook on the farmer protests.", "link": "https://www.ndtv.com/india-news/farmer-protest-sedition-law-cant-be-used-to-quieten-the-disquiet-says-delhi-court-2371953"},
{"title": "'Yoga Lessons From Baba Ramdev': Shashi Tharoor's Reply To Fuel Price Hike", "text": "Congress MP Shashi Tharoor tweeted a cartoon of yoga guru Baba Ramdev on Tuesday evening to take a swipe at the centre over soaring petrol and diesel prices", "link": "https://www.ndtv.com/india-news/petrol-price-hike-shashi-tharoor-tweet-oga-lessons-from-baba-ramdev-shashi-tharoors-answer-to-fuel-price-hike-2371945"},
{"title": "Meghalaya Further Lowers Petrol, Diesel Prices By Over Rs 5 Per Litre", "text": "Meghalaya government on Tuesday slashed retail prices of petrol and diesel by another over Rs 5 by reducing VAT on them, Chief Minister Conrad K Sangma said.", "link": "https://www.ndtv.com/india-news/meghalaya-further-lowers-petrol-diesel-prices-by-over-rs-5-per-litre-2371933"},
{"title": "Will Increase Covid Vaccination Sites Up To 5 Times, Says Centre", "text": "India will increase the number of its COVID-19 vaccination sites by up to five times after administering nearly 9 million shots in a month, a government official said on Tuesday, amid concerns about the speed of coverage in the country.", "link": "https://www.ndtv.com/india-news/will-increase-covid-19-vaccination-sites-up-to-5-times-says-centre-2371928"},
{"title": "Amnesty International India's Assets Attached In Money Laundering Case", "text": "The Enforcement Directorate has attached the movable properties - worth Rs 17.66 crore - of the global human rights advocacy group, Amnesty International, which had last year claimed that it was winding down its India operation because of alleged \"witch-hunt\" by the central government.", "link": "https://www.ndtv.com/india-news/amnesty-international-indias-assets-worth-over-rs-17-crore-attached-by-probe-agency-in-money-laundering-case-2371901"},
{"title": "In Madhya Pradesh, Over A Lakh Got Vaccines With Identical Phone Numbers", "text": "On February 13, as other states began administering the booster dose, Madhya Pradesh was not on that list; the state will begin its second round of vaccination on Saturday - 28 days later and a week behind parts of the country", "link": "https://www.ndtv.com/india-news/madhya-pradesh-coronavirus-vaccination-in-madhya-pradesh-over-1-lakh-got-vaccines-with-same-phone-number-2371855"},
{"title": "Over 87 Lakh COVID-19 Vaccine Doses Administered In India So Far", "text": "Over 87 lakh COVID-19 vaccine doses have been administered in India so far, informed the Union Health Ministry here on Tuesday.", "link": "https://www.ndtv.com/india-news/over-87-lakh-covid-19-vaccine-doses-administered-in-india-so-far-2371850"},
{"title": "Activist Shantanu Muluk Gets Transit Anticipatory Bail In Toolkit Case", "text": "Activist Shantanu Muluk, one of the three main accused in the \"Toolkit\" case, has received interim protection from arrest.", "link": "https://www.ndtv.com/india-news/activist-shantanu-muluk-one-of-the-accused-in-greta-thunberg-toolkit-case-gets-protection-from-arrest-2371838"},
{"title": "'Attempt To Browbeat Disha Ravi Into Submission': Mount Carmel Alumni", "text": "Over 300 alumni of Mount Carmel College in Bengaluru have written a letter of support and condemned the arrest of fellow alumnus Disha Ravi by the Delhi Police. Ms Ravi faces allegations that she was one of several people who prepared a \"toolkit\" to create disturbances over the protest by farmers. She was arrested by Delhi Police last week and taken to the national capital. The manner of her arrest and the charges have been condemned by the alumni as frivolous.", "link": "https://www.ndtv.com/india-news/attempt-to-browbeat-disha-ravi-into-submission-says-mount-carmel-college-alumni-in-letter-of-support-2371831"},
{"title": "Puri's Jagannath Temple Gets Approval For Heritage Corridor Project", "text": "The Jagannath Temple Management Committee has approved a Rs 800-crore heritage corridor project aimed at redeveloping the surrounding area of the 12th century shrine, sources said on Tuesday.", "link": "https://www.ndtv.com/india-news/puris-jagannath-temple-gets-approval-for-heritage-corridor-project-2371826"},
{"title": "Siddharth Chatterjee Takes Over As Top UN Diplomat In China", "text": "Senior UN official Siddharth Chatterjee has formally taken over as the United Nations Resident Coordinator in China, a key posting of overseeing the work of 27 agencies, funds and programmes of the global organisation in the world's most populous country.", "link": "https://www.ndtv.com/india-news/siddharth-chatterjee-takes-over-as-top-un-diplomat-in-china-2371824"},
{"title": "Average Assets Of Re-Elected Assam MLAs Increased By 95 Per Cent: Report", "text": "Assam Tourism Minister Chandan Brahma registered the highest growth rate of assets while Health Minister Himanta Biswa Sarma and former chief minister Prafulla Kumar Mahanta also figure among the top five re-elected MLAs whose assets increased significantly, according to a report.", "link": "https://www.ndtv.com/india-news/average-assets-of-re-elected-assam-mlas-increased-by-95-per-cent-report-2371818"},
{"title": "Delhi Women's Panel Seeks Delhi Police Report On Disha Ravi's Arrest", "text": "The Delhi Commission for Women has sent a notice to the Delhi Police on the arrest of 21-year-old climate campaigner Disha Ravi in the \"toolkit\" case and has sought a report on issues like why she was not provided a lawyer of her choice when produced before a court in Delhi.", "link": "https://www.ndtv.com/india-news/delhi-womens-panel-seeks-delhi-police-report-on-disha-ravis-arrest-2371813"},
{"title": "Warm Clothes, Time With Family Daily For Disha Ravi In Cops' Custody", "text": "A Delhi court today allowed Disha Ravi, the 22-year-old climate activist charged with sedition and whose arrest raised questions over due process followed by Delhi Police, will be allowed a copy of the FIR, a remand application and a fresh set of clothes", "link": "https://www.ndtv.com/india-news/disha-ravi-warm-clothes-time-with-family-daily-for-disha-ravi-in-cops-custody-2371808"},
{"title": "Memorial For Anti-CAA Protests In Assam If Voted To Power, Says Congress", "text": "Taking a hardened stand on the Citizenship (Amendment) Act or CAA, the Congress on Tuesday said it will build a memorial for those who died in the anti-CAA protests.", "link": "https://www.ndtv.com/india-news/memorial-for-anti-caa-protests-in-assam-if-voted-to-power-says-congress-2371796"},
{"title": "South Africa Covid Strain In 4 Returnees, Brazil Variant In 1: Government", "text": "A few cases of the more infectious South African and Brazilian strains of the coronavirus have been detected in India and people flying in from those countries may be tested more aggressively, the government said today.", "link": "https://www.ndtv.com/india-news/south-african-covid-strain-detected-in-4-returnees-brazil-variant-in-one-says-government-2371788"},
{"title": "Sena Trying To Shield Minister In Woman's Death Case: BJP Leader", "text": "BJP leader Atul Bhatkhalkar on Tuesday alleged the Shiv Sena was trying to shield its leader who is a minister in the Maharashtra cabinet, from any legal action in connection with the death of a 23-year-old woman.", "link": "https://www.ndtv.com/india-news/shiv-sena-trying-to-shield-minister-in-womans-death-case-bjps-atul-bhatkhalkar-2371777"},
{"title": "Smriti Irani Dares Rahul Gandhi To Contest Gujarat Polls If He Has 'Guts'", "text": "Union minister and BJP MP Smriti Irani on Tuesday dared Congress leader Rahul Gandhi to \"take out money\" from the pockets of small tea traders of Gujarat and to contest elections from the state if he has \"guts\".", "link": "https://www.ndtv.com/india-news/smriti-irani-dares-rahul-gandhi-to-contest-gujarat-polls-if-he-has-guts-2371770"},
{"title": "Ex-Haryana Chief Minister Bhupinder Singh Hooda Named In Complaint In Land Scam", "text": "Former Haryana chief minister Bhupinder Singh Hooda is among 22 people named in the Enforcement Directorate's prosecution complaint in the 2013 Panchkula industrial plot allotment scam.", "link": "https://www.ndtv.com/india-news/bhupinder-singh-hooda-ex-haryana-chief-minister-named-in-complaint-in-panchkula-industrial-plot-allotment-scam-2371767"},
{"title": "'Amazon Can Pick A Few Villages': Union Minister On Rural Digital Drive", "text": "The centre has asked Amazon to participate in developing \"digital villages\" across the country, on a day the online retail giant owned by Jeff Bezos announced that it would start manufacturing its flagship gadgets in India.", "link": "https://www.ndtv.com/india-news/amazon-can-pick-a-few-villages-says-union-minister-ravi-shankar-prasad-on-digital-village-drive-2371766"},
{"title": "'Want To Purify Thoughts': Haryana Minister Defends Tweet On Disha Ravi", "text": "Haryana Home Minister Anil Vij defended his tweet from Monday, claiming he did not mean to say Disha Ravi should be \"destroyed\" but that she needed to be \"purified\" of any \"anti-national mindset\"", "link": "https://www.ndtv.com/india-news/disha-ravi-farmers-protest-meant-anti-national-thought-haryana-minister-anil-vij-explains-destroy-tweet-2371758"},
{"title": "Robbery At Haryana BJP Leader's House, Jewellery, Cash, Gun Stolen: Cops", "text": "Jewellery, a licensed revolver, Rs 10 lakh and other valuables were stolen from BJP leader Sonali Phogat's house in Haryana's Hisar, the police said on Tuesday.", "link": "https://www.ndtv.com/india-news/robbery-at-haryana-bjp-leader-sonali-phogats-house-jewellery-rs-10-lakh-cash-gun-stolen-police-2371743"},
{"title": "PM Modi Expresses Grief Over Bus Accident In Madhya Pradesh", "text": "Sidhi Bus Accident: Prime Minister Narendra Modi on Tuesday expressed grief at the \"horrific\" bus accident in Madhya Pradesh's Sidhi district and approved compensation of Rs 2 lakh each to the families of those who lost their lives.", "link": "https://www.ndtv.com/india-news/pm-modi-expresses-grief-over-bus-accident-in-madhya-pradesh-2371739"},
{"title": "Amid Rising Cases, Mumbai Mayor's Lockdown Caution", "text": "As Mumbai records a surge in Covid cases, a lockdown is a possibility, a top Mumbai official warned today. But whether the city will go into lockdown mode once again would depend on the people, said Mumbai Mayor Kishori Pednekar.", "link": "https://www.ndtv.com/india-news/another-mumbai-lockdown-amid-rising-coronavirus-cases-what-mayor-kishori-pednekar-said-2371730"},
{"title": "BJP Announces Candidates For Bypolls For 2 Rajya Sabha Seats In Gujarat", "text": "The BJP on Tuesday announced the names of candidates who will be contesting the byelections for two Rajya Sabha seats in Gujarat which will be held on March 1.", "link": "https://www.ndtv.com/india-news/bjp-announces-candidates-for-bypolls-for-2-rajya-sabha-seats-in-gujarat-2371720"},
{"title": "Red Fort Violence: Delhi Court Extends Actor-Activist Deep Sidhu's Custody By 7 Days", "text": "A Delhi court today extended by seven days the police custody of actor-activist Deep Sidhu in connection with the Red Fort violence on Republic Day during the farmers' tractor parade against the Centre's three new farm laws.", "link": "https://www.ndtv.com/india-news/red-fort-violence-delhi-court-extends-actor-activist-deep-sidhus-custody-by-7-days-2371719"},
{"title": "WhatsApp Messages, Flirting By Judge Draw Supreme Court Warning", "text": "The Supreme Court today said a judge \"sending offensive and improper messages to (a) junior officer and flirting with her is not acceptable\".", "link": "https://www.ndtv.com/india-news/whatsapp-messages-flirting-by-judge-draws-supreme-court-warning-2371714"},
{"title": "BSP Leader Shot Dead Over Old Enmity In UP's Azamgarh: Police", "text": "A local BSP leader was shot dead in the Mehnagar police station area in this Uttar Pradesh district allegedly over an old rivalry, police said on Tuesday.", "link": "https://www.ndtv.com/india-news/bsp-leader-shot-dead-over-old-enmity-in-ups-azamgarh-police-2371700"},
{"title": "Supreme Court To Consider Plea Seeking Urgent COVID-19 Vaccine For Judiciary", "text": "The Supreme Court today agreed to hear a plea seeking inclusion of judges, judicial staff and lawyers in the priority category for administration of COVID-19 vaccine.", "link": "https://www.ndtv.com/india-news/supreme-court-to-consider-plea-seeking-urgent-covid-19-vaccine-for-judiciary-2371692"},
{"title": "Badrinath Temple In Uttarakhand To Reopen For Devotees On May 18", "text": "The Badrinath temple will reopen for devotees on May 18 this year. The gates of the famous Himalayan shrine located in Uttarakhand's Chamoli district are closed every year with the onset of winter when it remains covered in snow.", "link": "https://www.ndtv.com/india-news/badrinath-temple-in-uttarakhand-to-reopen-for-devotees-on-may-18-2371678"},
{"title": "Rahul Gandhi ''Migrant Leader'' Who Has Taken Refuge In Kerala: BJP", "text": "BJP on Tuesday attacked Congress leader Rahul Gandhi, calling him a \"migrant leader\" who has taken \"shelter\" in Kerala after being rejected by people of Amethi, once a stronghold of his family.", "link": "https://www.ndtv.com/india-news/rahul-gandhi-migrant-leader-who-has-taken-refuge-in-kerala-bjp-2371664"},
{"title": "China Withdraws 140 Tanks, 60 Artillery Guns, 7,000 Troops In Ladakh Deescalation", "text": "Indian and Chinese tanks were seen disengaging from the banks of Pangong lake area in eastern Ladakh where were deployed amid a standoff areas along the Line of Actual Control. Multiple videos and images released by the Indian Army today show the continued process of disengagement between Chinese and Indian forces on both banks of the glacial lake, seen to be a breakthrough after the forces of both sides were involved in a face-off on this area for nearly a year.", "link": "https://www.ndtv.com/india-news/in-new-ladakh-videos-chinese-troops-remove-tents-walk-to-waiting-trucks-2371661"},
{"title": "Considering 'Some Action' To Regulate Streaming Platforms: Centre To Supreme Court", "text": "The Centre today told the Supreme Court that it was contemplating \"some action\" on the issue of regulating OTT or video streaming platforms such as Netflix, Amazon Prime, Disney+ Hotstar, Sony Liv.", "link": "https://www.ndtv.com/india-news/considering-some-action-to-regulate-streaming-platforms-centre-to-supreme-court-2371658"},
{"title": "Indian High Commission's Open Letter After UK MP Claudia Webbe's Farmer Protest Tweets", "text": "As United Kingdom Member of Parliament (MP) for Leicester East, Claudia Webbe, extended support to the farmers' protest, the Indian High Commission in London wrote an open letter on Tuesday saying that the MP was welcome to convey any apprehensions of the community that she represented to the High Commission.", "link": "https://www.ndtv.com/india-news/indian-high-commissions-open-letter-to-british-mp-claudia-webbe-after-she-backed-farmers-protest-2371642"},
{"title": "South Africa Asks Serum Institute To Take Back 1 Million Vaccine Doses: Report", "text": "South Africa has asked the Serum Institute of India to take back the one million COVID-19 vaccine doses the company had sent in early February, The Economic Times reported on Tuesday, a week after the country said it will put on hold use of AstraZeneca's shot in its vaccination program.", "link": "https://www.ndtv.com/india-news/south-africa-asks-serum-institute-to-take-back-1-million-vaccine-doses-report-2371639"},
{"title": "'Breakfast, No Politics': Mithun Chakraborty Hosts RSS Chief Mohan Bhagwat", "text": "Actor Mithun Chakraborty had Rashtriya Swayamsevak Sangh (RSS) chief Mohan Bhagwat over for breakfast today at his home in Mumbai. The meeting is significant ahead of the election in Bengal, the actor's native state, though he denied any politics in it.", "link": "https://www.ndtv.com/india-news/mithun-chakraborty-has-rss-chief-mohan-bhagwat-over-for-breakfast-says-no-politics-2371615"},
{"title": "Rama Jois, Eminent Jurist, Dies. PM Modi And Others Pay Homage", "text": "Rama Jois dies: Eminent jurist and former Governor of Bihar and Jharkhand, Justice (Retd) Rama Jois died on Tuesday. \"Justice (Retd) M Rama Jois was a towering intellectual and jurist. He was admired for his rich intellect and contributions towards making India's democratic fabric stronger...,\" Prime Minister Narendra Modi tweeted in his condolence message.", "link": "https://www.ndtv.com/india-news/rama-jois-eminent-jurist-dies-pm-modi-others-pay-homage-2371591"},
{"title": "'Anti-India Elements Want To Spread Instability': Minister G Kishan Reddy", "text": "The Minister of State (MoS) for Home Affairs G Kishan Reddy on Tuesday said that many anti-India elements want to spread instability within the country and the national capital had been the focal point.", "link": "https://www.ndtv.com/india-news/anti-india-elements-want-to-spread-instability-says-mos-home-2371571"},
{"title": "Happy Saraswati Puja 2021: Basant Panchami Wishes And Messages To Share", "text": "Saraswati Puja wishes: Today is Basant Panchami and the country celebrates Saraswati Puja. Basant Panchami is dedicated to Devi Saraswati, the goddess of, knowledge, learning, arts, music and wisdom. Here are wishes and messages to send on Saraswati Puja", "link": "https://www.ndtv.com/india-news/happy-saraswati-puja-2021-on-basant-panchami-today-share-wishes-and-messages-with-loved-ones-2371564"},
{"title": "51 Dead As Bus Falls Into Canal In Madhya Pradesh", "text": "At least 51 people have died in Madhya Pradesh's Sidhi district, about 560 km from state capital Bhopal, after a bus fell off a bridge into a canal this morning.", "link": "https://www.ndtv.com/india-news/18-dead-in-madhya-pradeshs-sidhi-district-after-bus-falls-off-bridge-into-canal-more-feared-drowned-2371562"},
{"title": "32 Dead, Several Missing After Bus Falls Into Canal In Madhya Pradesh", "text": "At least 32 people died while many others were missing after a bus fell off a bridge into a canal near Patna village in Madhya Pradesh's Sidhi district on Tuesday morning, police said.", "link": "https://www.ndtv.com/india-news/18-dead-at-least-20-missing-after-bus-falls-into-canal-in-madhya-pradesh-2371561"},
{"title": "Delhi Court Issues Summons To Kanhaiya Kumar, 9 Others In JNU Sedition Case", "text": "A Delhi court has taken cognisance of the charge sheet filed by Delhi Police in the Jawaharlal Nehru University (JNU) sedition case in which Communist Party of India (Marxist) leader Kanhaiya Kumar is an accused along with others.", "link": "https://www.ndtv.com/india-news/2016-jnu-sedition-case-delhi-court-issues-summons-to-kanhaiya-kumar-9-others-2371487"},
{"title": "'22 Or 50, Law Equal For All': Delhi Police On Activist Disha Ravi", "text": "With the Delhi Police intensifying its probe into the \"toolkit\" , shared by Swedish Climate activist Greta Thunberg earlier this month, the role of farmer leaders may also be probed, sources have said.", "link": "https://www.ndtv.com/india-news/greta-thunberg-toolkit-case-cops-write-to-zoom-over-toolkit-farm-leaders-role-to-be-probed-sources-2371551"},
{"title": "Watch: Priyanka Gandhi Vadra's Rowing Lesson From Boatman In UP", "text": "Priyanka Gandhi Vadra's rowing lesson in Allahabad in Uttar Pradesh, when she took a holy dip recently at the Sangam, is in wide circulation on social media.", "link": "https://www.ndtv.com/india-news/watch-priyanka-gandhi-vadras-rowing-lesson-from-boatman-in-up-2371534"},
{"title": "Congress Government In Puducherry Slips Into Minority Ahead Of Polls", "text": "Months before an election, the Congress government has lost its thin majority in Puducherry with four MLAs resigning, two in the past two days.", "link": "https://www.ndtv.com/india-news/puducherry-congress-government-in-minority-as-four-mlas-quit-two-in-the-past-two-days-2371517"}
]